# копейка - 1 21 31 41 51 61 71 81 91
# копейки - 2 3 4 22 23 24 32 33 34 42 43 44 52 53 54 62 63 64
# 72 73 74 82 83 84 92 93 94
# копеек 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 25 26 27 28 29
# 20 25 26 27 28 29 30 45 46 47 48 49 50 65 66 67 68 69 70 85 86 87 88 89 90 95 96 97 98 99

n = int(input("Введите число копеек: "))
if 0<= n <= 99:
    print("В кошельке", n, end=" ")
    if n == 1:
        print("копейка")
    if n % 10 == 1:
        print("копейка")
    if 2 <= n <= 4:
        print("копейки")
    if 2 <= n % 10 <= 4:
        print("копейки")
    if 5 <= n <= 19:
        print("копеек")
    if 5 <= n % 10 <= 9:
        print("копеек")
    if n % 10 == 0:
        print("копеек")
    if 5 <= n % 10 <= 9:
        print("копеек")
else:
    print("НЕ ЗАРАБОТАЛ!!!")


